#Использовать asserts
#Использовать json

Перем Соединение;
Перем ПарсерJSON;

//*****************************************************************
Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

    ВсеТесты = Новый Массив;

    // склонение ФИО
    ВсеТесты.Добавить("СклонениеФИОСпустымРежимом");
    // ВсеТесты.Добавить("СклонениеФИОПоЧастям");
    // ВсеТесты.Добавить("СклонениеФИОСУчнтомРегистра");
    
    // ВсеТесты.Добавить("ОпределениеРода");

    // // склонение профессии
    // ВсеТесты.Добавить("СклонениеПрофессии");
    // ВсеТесты.Добавить("СклонениеПрофессииСОпределениемРегистраРезультата");

    // // склонение существительных, прилагательных, глаголов, географических наименований
    // ВсеТесты.Добавить("СклонениеСуществительныхИПрилагательных");
    // ВсеТесты.Добавить("СклонениеВоМножественномЧисле");
    // ВсеТесты.Добавить("СклонениеГеографическихНаименований");
    // ВсеТесты.Добавить("СклонениеГлаголаПоРодамИПоЧислам");

    // // склонение чисел, валют, единиц измерения
    // ВсеТесты.Добавить("СклонениеЧислаСтрокой");
    // ВсеТесты.Добавить("СклонениеЧисла");
    // ВсеТесты.Добавить("СклонениеЧислаИИсчислимого");
    // ВсеТесты.Добавить("СклонениеСНеизменяемымСловом");
    // ВсеТесты.Добавить("СклонениеЧислаБезПреобразованияВПропись");
    // ВсеТесты.Добавить("СклонениеВВинительномПадежеНеодушевленныхСуществительных");
    // ВсеТесты.Добавить("СклонениеВВинительномПадежеОдушевленныхСуществительных");

    Возврат ВсеТесты;

КонецФункции
 
//*****************************************************************
Процедура ПередЗапускомТеста() Экспорт

	Соединение = Новый HTTPСоединение("localhost", 5000);
	ПарсерJSON = Новый ПарсерJSON;

КонецПроцедуры
 
//*****************************************************************
Процедура ПослеЗапускаТеста() Экспорт


КонецПроцедуры


//////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ДЛЯ ТЕСТИРОВАНИЯ ФУНКЦИОНАЛА

//*****************************************************************

Процедура СклонениеФИОСпустымРежимом() Экспорт

	Результат = ПолучитьОтветНаЗапрос("declension", "s=Пухова Ольга Сергеевна&c=Д");
	Ожидаем.Что(Результат).Равно("Пуховой Ольге Сергеевне");
      
КонецПроцедуры 

Функция ПолучитьОтветНаЗапрос(Метод, ПараметрыМетода)

	Запрос = Новый HTTPЗапрос;
	Запрос.АдресРесурса = СтрШаблон("/api/%1?%2", Метод, ПараметрыМетода);
	Ответ = Соединение.Получить(Запрос);
	СтрокаОтвета = Ответ.ПолучитьТелоКакСтроку();
	Результат = ПарсерJSON.ПрочитатьJSON(СтрокаОтвета,,,Истина);

	Возврат Результат.result;

КонецФункции	